app/controllers/brands_controller.rb

INSERT INTO "brands" ("name", "description", "featured", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["description", "test"], ["featured", false], ["created_at", "2020-04-06 20:38:37.972843"], ["updated_at", "2020-04-06 20:38:37.972843"]]
---
  def create
    @brand = Brand.new(brand_params)

    if @brand.save

UPDATE "brands" SET "description" = $1, "featured" = $2, "updated_at" = $3 WHERE "brands"."id" = $4  [["description", "test1"], ["featured", true], ["updated_at", "2020-04-06 20:39:17.275067"], ["id", 11]]
---
  def update
    if @brand.update(brand_params)

DELETE FROM "brands" WHERE "brands"."id" = $1  [["id", 11]]
---
  def destroy
    @brand.destroy

SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_brand
      @brand = Brand.find(params[:id])