app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)
    @item.brand_id = params[:brand_id]
    if @item.save
---
INSERT INTO "items" ("title", "image", "price", "gender", "created_at", "updated_at", "brand_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["image", "abc"], ["price", 29], ["gender", "F"], ["created_at", "2020-04-06 20:41:02.247963"], ["updated_at", "2020-04-06 20:41:02.247963"], ["brand_id", 11]]

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "price" = $1, "gender" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["price", 39], ["gender", "M"], ["updated_at", "2020-04-06 20:42:56.358613"], ["id", 38]]