app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("body", "rating", "created_at", "updated_at", "item_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "test"], ["rating", 4], ["created_at", "2020-04-06 21:04:22.144396"], ["updated_at", "2020-04-06 21:04:22.144396"], ["item_id", 38]]
---
  def create
    @review = Review.new(review_params)
    @review.item_id = params[:item_id]
    if @review.save

UPDATE "reviews" SET "body" = $1, "rating" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["body", "test1"], ["rating", 5], ["updated_at", "2020-04-06 21:06:32.382414"], ["id", 4]]
---
  def update
    if @review.update(review_params)